{"pages":[{"title":"关于","text":"Crazy-Sky软件工程专业学生一枚本博客专注于学习记录以及技术分享","link":"/about/index.html"}],"posts":[{"title":"hexo","text":"欢迎来到Hexo! 这是您的第一篇文章。查看文档 以获取更多信息。如果在使用Hexo时遇到任何问题，可以在故障排除中 找到答案，也可以在GitHub上问我。. 快速开始建立新讯息1$ hexo new \"我的新帖子\" 更多信息：写作 运行服务器1$ hexo server 更多信息：服务器 生成静态文件1$ hexo generate 更多信息：生成 部署到远程站点1$ hexo deploy 更多信息：部署 学习所得，资料、图片部分来源于网络，如有侵权，请联系本人删除。","link":"/2020/03/02/hexo/"},{"title":"四则运算","text":"1、题目要求 写一个能自动生成小学四则运算题目的命令行 “软件”。具体要求：任何编程语言都可以，命令行程序接受一个数字输入，然后输出相应数目的四则运算题目和答案。例如输入数字是 30， 那就输出 30 道题目和答案。 运算式子必须至少有两个运算符，运算数字是在 100 之内的正整数，答案不能是负数。 如：23 - 3 * 4 = 11扩展要求：看看小学三、四、五年级的四则运算要求， 逐步实现各个年级的难度。 写博客记录自己实现每一个扩展的思路。 在扩展的过程种，你是独立开发每个年级的运算题的功能，处理四年级的代码和三年级的代码没有任何联系，还是逐步把一些公共的代码放在一起？ 或者你用面向对象的方法，运用基类 (base class) 和子类来管理各种不同的需求和实现的细节？ 2、需求分析 通过题目得出如下基础需求： 运算式子暂固定为两个运算符，运算符随机（+、-、*、/） 运算数字是在 100 之内的正整数 3、开发环境 eclipse luna 4.4.0 winX86jdk1.8.0_102 winX86 4、设计思路 项目运用面向对象方法，运用基类 和子类来管理各种不同的需求和实现的细节根据题目要求，确定基础需求，实现基础功能，并初步实现基类开发 5、代码实现基类(Generate )仅实现基础的单个题目的加、减、乘、除及输出功能 1234567891011121314151617181920212223242526272829303132333435public class Generate { void printArithmetic(int num1, int num2, int num3, char operator1, char operator2, int value) { System.out.println(num1 + \" \" + operator1 + \" \" + num2 + \" \" + operator2 + \" \" + num3 + \" = \" + value); } int calculation(int num1, int num2, char operator) { switch (operator) { case '+': return num1 + num2; case '-': return num1 - num2; case '*': return num1 * num2; case '/': return num1 / num2; } return 0; } void generate(int num1, int num2, int num3, char operator1, char operator2) { int value = 0; if ((operator1 == '+' || operator1 == '-') &amp;&amp; (operator2 == '*' || operator2 == '/')) { value = calculation(num1, calculation(num2, num3, operator2), operator1); } else { value = calculation(calculation(num1, num2, operator1), num3, operator2); } printArithmetic(num1, num2, num3, operator1, operator2, value); }} 自动生成类(AutoGenerated)继承自基类（Generate ）,此类实现了基础功能需求，可为以此为今后完善扩展之基础： 123456789101112131415161718192021222324252627282930313233343536373839404142434445464748495051525354555657585960616263646566676869707172737475767778798081828384858687888990919293949596979899100101102103104105106import java.util.Scanner;public class AutoGenerated extends Generate { char operators[] = { '+', '-', '*', '/' }; public static void main(String[] args) { Scanner sc = new Scanner(System.in); AutoGenerated autoGenerated = new AutoGenerated(); int count = sc.nextInt(); autoGenerated.generateSubject(count, 99); } int random(int min, int max) { return (int) (Math.random() * (max - min) + min); } void generateSubject(int count, int maxValue) { int num1 = 0, num2 = 0, num3 = 0; char operator1 = ' ', operator2 = ' '; for (int i = 0; i &lt; count; i++) { operator1 = operators[random(0, 4)]; operator2 = operators[random(0, 4)]; num1 = random(1, maxValue); num2 = random(1, maxValue); num3 = random(1, maxValue); if (operator1 == '+' &amp;&amp; (operator2 == '+' || operator2 == '-')) { num2 = random(1, maxValue - num1); if (operator2 == '+') { num3 = random(1, maxValue - (num1 + num2)); } else { num3 = random(1, num1 + num2); } } if (operator1 == '+' &amp;&amp; operator2 == '*') { num3 = random(1, maxValue / num2); num1 = random(1, maxValue - (num2 * num3)); } if (operator1 == '+' &amp;&amp; operator2 == '/') { num3 = random(1, num2); while (num2 % num3 != 0) { num3++; } num1 = random(1, maxValue - (num2 / num3)); } if (operator1 == '-' &amp;&amp; (operator2 == '+' || operator2 == '-')) { num2 = random(1, num1); if (operator2 == '-') { num3 = random(1, num1 - num2); } else { num3 = random(1, maxValue - (num1 - num2)); } } if (operator1 == '-' &amp;&amp; operator2 == '*') { num3 = random(1, maxValue / num2); num1 = random(num2 + num3, maxValue); } if (operator1 == '-' &amp;&amp; operator2 == '/') { num3 = random(1, num2); while (num2 % num3 != 0) { num3++; } num1 = random(num2 / num3, maxValue); } if (operator1 == '*' &amp;&amp; (operator2 == '-' || operator2 == '+' || operator2 == '*' || operator2 == '/')) { num2 = random(1, maxValue / num1); if (operator2 == '-') { num3 = random(1, num1 * num2); } else if (operator2 == '+') { num3 = random(1, maxValue - num1 * num2); } else if (operator2 == '*') { num3 = random(1, maxValue / (num1 * num2)); } else { num3 = random(1, Math.max(num1, num2)); while ((num1 * num2) % num3 != 0) { num3++; } } } if (operator1 == '/' &amp;&amp; (operator2 == '+' || operator2 == '*' || operator2 == '-' || operator2 == '/')) { num2 = random(1, num1); while (num1 % num2 != 0) { num2++; } if (operator2 == '+') { num3 = random(1, maxValue - num1 / num2); } else if (operator2 == '-') { num3 = random(1, num1 / num2); } else if (operator2 == '*') { num3 = random(1, maxValue / (num1 / num2)); } else { num3 = random(1, Math.max(num1, num2)); while ((num1 * num2) % num3 != 0) { num3++; } } } super.generate(num1, num2, num3, operator1, operator2); } }} 6、运行结果 7、总结 本文只是实现了题项目的基础功能需求，对于项目扩展功能，暂未实现，且在易扩展性方面尚需改进。主要原因如下： 时间紧迫，开始着手项目时间较晚（由于之前电脑坏了，新电脑才到不久，大多时间在于软件安装，以及环境部署）。 久疏战阵，由于长时间在研究新技术，以及学习JavaEE，对于JavaSE部分内容及算法方面较为生疏。 当然本项目也是有优点的，通过控制随机数的生成，实现了生成的题目具有更好的随机性。由于在随机数生成方面编写了大量代码来控制，使得题目具有更好的正确性，同时实现了随机数“一次生成”，在需要大量生成题目的情况下，大大减少了生成时间。","link":"/2020/03/10/%E5%9B%9B%E5%88%99%E8%BF%90%E7%AE%97/"},{"title":"第一章 Java语言概述","text":"1、基础常识 软件，及一系列按照特定顺序组织的计算机数据和指令的集合。有系统软件和应用软件之分。 人机交互方式 图形化界面 命令行方式 常用Dos命令 dir ：列出当前目录下的文件以及文件夹md ：创建目录rd ：删除目录cd ：进入指定目录cd.. ：退回到上一级目录cd\\ ：退回到根目录del ：删除文件exit ：退出dos命令行 2、Java语言概述 计算机语言：人与计算机交流的方式。 第一代语言 打孔机–纯机器语言 第二代语言 汇编 第三代语言平台 C、Pascal、Fortran面向过程的语言 C++面向过程/面向对象 Java跨平台的纯面向对象的语言 .NET跨语言的 面向过程：就是分析出解决问题所需要的步骤，然后用函数把这些步骤一步一步实现，使用的时候一个一个依次调用就可以了。面向对象：是把构成问题事务分解成各个对象，建立对象的目的不是为了完成一个步骤，而是为了描叙某个事物在整个解决问题的步骤中的行为。 Java语言的诞生、特点 java之父James Gosling团队在开发”Green”项目时，发现C缺少垃圾回收系统，还有可移植的安全性、分布程序设计、和多线程功能。最后，他们想要一种易于移植到各种设备上的平台Java确实是从C语言和C++语言继承了许多成份，甚至可以将Java看成是类C语言发展和衍生的产物。比如Java语言的变量声明，操作符形式，参数传递，流程控制等方面和C语言、C++语言完全相同。但同时，Java是一个纯粹的面向对象的程序设计语言，它继承了 C++语言面向对象技术的核心。Java舍弃了C语言中容易引起错误的指针（以引用取代）、运算符重载（operator overloading）、多重继承（以接口取代）等特性，增加了垃圾回收器功能用于回收不再被引用的对象所占据的内存空间。JDK1.5又引入了泛型编程（Generic Programming）、类型安全的枚举、不定长参数和自动装/拆箱 Java语言概述 是SUN(Stanford University Network，斯坦福大学网络公司)1995年推出的一门高级编程语言。 95年，SUN发布JDK 1.0，98年，JDK1.2，后续JDK1.3， 1.4，1.5（更名为Java5.0）最新为JDK13。 是一种面向Internet的编程语言。 随着Java技术在web方面的不断成熟，已经成为Web应用程序的首选开发语言。 java语言的主要特性 Java语言是易学的。Java语言的语法与C语言和C++语言很接近，使得大多数程序员很容易学习和使用Java。 Java语言是强制面向对象的。Java语言提供类、接口和继承等原语，为了简单起见，只支持类之间的单继承，但支持接口之间的多继承，并支持类与接口之间的实现机制（关键字为implements）。 Java语言是分布式的。Java语言支持Internet应用的开发，在基本的Java应用编程接口中有一个网络应用编程接口（java net），它提供了用于网络应用编程的类库，包括URL、URLConnection、Socket、ServerSocket等。Java的RMI（远程方法激活）机制也是开发分布式应用的重要手段。 Java语言是健壮的。Java的强类型机制、异常处理、垃圾的自动收集等是Java程序健壮性的重要保证。对指针的丢弃是Java的明智选择。 Java语言是安全的。Java通常被用在网络环境中，为此，Java提供了一个安全机制以防恶意代码的攻击。如：安全防范机制（类ClassLoader），如分配不同的名字空间以防替代本地的同名类、字节代码检查。 Java语言是跨平台的。Java程序（后缀为java的文件）在Java平台上被编译为体系结构中立的跨平台的字节码格式（后缀为class的文件），然后可以在实现这个Java平台的任何系统中运行。 Java语言是解释型的。如前所述，Java程序在Java平台上被编译为字节码格式，然后可以在实现这个Java平台的任何系统的解释器中运行。 Java是性能略高的。与那些解释型的高级脚本语言相比，Java的性能还是较优的。 Java语言是原生支持多线程的。在Java语言中，线程是一种特殊的对象，它必须由Thread类或其子（孙）类来创建。 Java技术体系平台 Java SE(Java Standard Edition)标准版 支持面向桌面级应用（如Windows下的应用程序）的Java平台，提供了完整的Java核心API，此版本以前称为J2SE Java EE(Java Enterprise Edition)企业版 是为开发企业环境下的应用程序提供的一套解决方案。该技术体系中包含的技术如:Servlet 、Jsp等，主要针对于Web应用程序开发。版本以前称为J2EE Java ME(Java Micro Edition)小型版 支持Java程序运行在移动终端（手机、PDA）上的平台，对Java API有所精简，并加入了针对移动终端的支持，此版本以前称为J2ME Java Card 支持一些Java小程序（Applets）运行在小内存设备（如智能卡）上的平台 Java的应用领域 企业级应用：主要指复杂的大企业的软件系统、各种类型的网站。Java的安全机制以及它的跨平台的优势，使它在分布式系统领域开发中有广泛应用。应用领域包括金融、电信、交通、电子商务等。 Android平台应用：Android应用程序使用Java语言编写。Android开发水平的高低很大程度上取决于Java语言核心能力是否扎实。 嵌入式应用：是指在各种小型设备上的应用，包括手机、PDA、机顶盒、汽车通信设备等。 3、Java语言运行机制及运行过程Java两种核心机制 Java虚拟机（Java Virtal Machine），JVM 垃圾收集机制（Garbage Collection），GC Java虚拟机 JVM是一个虚拟的计算机，具有指令集并使用不同的存储区域。负责执行指令，管理数据、内存、寄存器。 对于不同的平台，有不同的虚拟机。 Java虚拟机机制屏蔽了底层运行平台的差别，实现了“一次编译，到处运行”。 垃圾回收 不再使用的内存空间应回收—— 垃圾回收。 在C/C++等语言中，由程序员负责回收无用内存。 Java 语言消除了程序员回收无用内存空间的责任：它提供一种系统级线程跟踪存储空间的分配情况。并在JVM空闲时，检查并释放那些可被释放的存储空间。 垃圾回收在Java程序运行过程中自动进行，程序员无法精确控制和干预。 4、Java语言的环境搭建下载、安装JDK 官方网址： https://www.oracle.com/technetwork/java/javase/downloads/index.html 安装JDK 傻瓜式安装，下一步即可。 建议：安装路径不要有中文或者特殊符号如空格等。 当提示安装 JRE 时，可以选择不安装。 推荐安装 链接：https://pan.baidu.com/s/1Yo0TmmvqcPAg3RTUPrY75g 提取码：d6zc 直接下载需要的对应版本压缩包，方便在需要使用多个版本jdk时的切换。 配置环境变量 新建系统变量JAVA_HOME 解压jdk的目录（如“D:\\Learn\\java\\jdk1.8.0_102”） 在系统变量Path中新建 %JAVA_HOME%\\bin 验证是否成功 命令行输入命令：java -version 什么是JDK，JRE JDK(Java Development Kit Java开发工具包) JDK是提供给Java开发人员使用的，其中包含了java的开发工具，也包括了JRE。所以安装了JDK，就不用在单独安装JRE了。其中的开发工具：编译工具(javac.exe) 打包工具(jar.exe)等 JRE(Java Runtime Environment Java运行环境) 包括Java虚拟机(JVM Java Virtual Machine)和Java程序所需的核心类库等，如果想要运行一个开发好的Java程序，计算机中只需要安装JRE即可。简单而言，使用JDK的开发工具完成的java程序，交给JRE去运行。 JVM、JRE、JDK 关系 5、HelloWorld步骤： 将 Java 代码编写到扩展名为 .java 的文件中。 通过 javac 命令对该 java 文件进行编译。 通过 java 命令对生成的 class 文件进行运行。 步骤一：编写 选择最简单的编辑器：记事本。 敲入代码 将文件保存成HelloWorld.java，这个文件是存放java代码的文件，称为源文件。 12345public class HelloWorld{ public static void main(String args[]){ System.out.println(\"Hello World\"); }} 步骤二：编译 有了java源文件，通过编译器将其编译成JVM可以识别的字节码文件。 在该源文件目录下，通过javac编译工具对HelloWorld.java文件进行编译。 如果程序没有错误，没有任何提示，但在当前目录下会出现一个HelloWorld.class文件，该文件称为字节码文件，也是可以执行的java的程序。 步骤三：运行 有了可执行的java程序(HelloWorld.class字节码文件) 通过运行工具java.exe对字节码文件进行执行。 6、小结第一个程序 Java源文件以“java”为扩展名。源文件的基本组成部分是类（class），如本类中的HelloWorld类。 Java应用程序的执行入口是main()方法。它有固定的书写格式：public static void main(String[] args) {…} Java语言严格区分大小写。 Java方法由一条条语句构成，每个语句以“;”结束。 括号都是成对出现的，缺一不可。 7、常见问题及解决方法 源文件名不存在或者写错，或者当前路径错误。 类文件名写错，或者类文件不在当前路径下，或者环境变量没有配置好。 声明为public的主类应与文件名一致，否知编译失败 编译失败，注意错误出现的行数，再到源代码中指定位置改错 8、注 释 用于注解说明解释程序的文字就是注释。 提高了代码的阅读性；调试程序的重要方法。 注释是一个程序员必须要具有的良好编程习惯。 将自己的思想通过注释先整理出来，再用代码去体现 Java中的注释类型： 单行注释 // 多行注释/* */ 文档注释（java特有） 单行注释1//注释文字 多行注释1/* 注释文字 */ 文档注释（java特有）12345/** * @author 指定java程序的作者 * @version 指定源文件的版本 * @param 方法的参数说明信息 */ 注： 对于单行和多行注释，被注释的文字，不会被JVM（java虚拟机）解释执行。 多行注释里面不允许有多行注释嵌套。 注释内容可以被JDK提供的工具 javadoc 所解析，生成一套以网页文件形式体现的该程序的说明文档。 来自b站 求知讲堂小龙https://www.bilibili.com/video/av76235341?p=1学习所得，资料参考其所讲内容，图片部分来源于网络，如有侵权，请联系本人删除。","link":"/2020/03/09/%E7%AC%AC%E4%B8%80%E7%AB%A0%20Java%E8%AF%AD%E8%A8%80%E6%A6%82%E8%BF%B0/"},{"title":"第一部分 软件工程概述（一）","text":"郑人杰 《软件工程概论》（第2版）第一部分 软件工程概述（一） 课后习题题解 第一章 软件与软件工程的概念 1、举出你所知道的传统应用软件的例子。 办公软件、游戏软件、财务软件、银行软件、人事管理软件、学籍管理软件等。 2、“软件就是程序，软件开发就是编程序。”这种观点是否正确？为什么？ 认为“软件就是程序，软件开发就是编程序。”这种观点是错误的。 首先，软件是计算机系统中与硬件相互依存的另一部分，它包括程序、数据、及其相关文档的完整集合，程序只是软件的组成部分之一；其次，在软件开发中，编程只是软件开发过程中的一个阶段。 3、如果将软件开发比作高楼大厦的建造，可以将软件设计比做什么？ 可以将软件的设计比作建筑设计，软件设计的成果相当于建筑设计的图纸。 4、简述软件的分类，并举例说明。 在《软件工程概论》第2版中，按照软件的作用，将软件分为系统软件、应用软件、支撑软件、可复用软件4类。 系统软件：系统软件居于计算机系统中最靠近硬件的一层，其他软件一般通过系统软件发挥作用。系统软件与具体的应用领域无关。例如：操作系统、设备驱动程序、通信和网络处理程序。 应用软件：应用软件是特定应用领域专用的软件。例如：工程、科学计算软件、Web应用软件、人工智能软件。 支撑软件：支撑软件是支撑软件开发和维护的软件。例如：网络软件、软件工具、软件开发环境。 可复用软件：在开发新的软件时，可以对已有的可复用构件稍加修改或不加修改，复用所需的属性或服务。例如：各种标准函数库。 5、请给出你所知道的互联网应用软件的例子。传统应用软件与互联网应用软件有哪些不同之处？ 与传统软件较长的软件生存周期相比，互联网软件的软件生存周期更短，要求开发者想办法在较短的时间内完成计划、分析、设计、编码、测试，及时向用户发布； 与传统软件不同，一个互联网软件一般都有许多许多用户在同一时间访问，要求互联网软件能应对数量不明确的用户的访问和请求，支持并发； 传统软件可能需要针对不同的应用平台发布不同的软件版本让不同平台上的用户能够使用，而互联网软件则能让不同平台用户能够通过Web浏览器方便地使用； 不同于传统的、按一系列规划的时间间隔发布并进行演化的应用软件，互联网软件应不断地进行演化； 互联网软件依赖于网络而存在，需要服务变化多样的客户群。它需要一定程度上的互联网的支持才能够正常运行，而且网络状况的好坏也对互联网软件的运行有着较大的影响； 互联网软件是通过网络访问可达的，因此要限制终端用户的使用就比较困难。要保护软件的安全和稳定就必须采取有效的安全措施。 6、什么是软件危机？它有哪些典型表现？为什么会出现软件危机？ 软件危机是指计算机软件开发、使用与维护过程中所遇到的一系列严重问题和难题。 典型表现有： 对软件开发成本和进度的估计常常很不准确； 软件产品的质量往往靠不住； 用户对已完成的软件系统不满意的现象经常发生； 软件常常是不可维护的； 软件中没有适当的文档资料； 软件成本在计算机系统总成本所占的比例逐年上升； 软件开发生产率提高的速度，往往跟不上计算机应用迅速普及深入的趋势。 原因： 软件本身独有的特点确实给开发和维护带来了困难； 与软件开发和维护的许多错误认识和做法的形成有关； 面对日益增长的软件需求，人们显得力不从心。 7、什么是软件工程？软件工程要解决核心问题是什么？ 应用计算机科学理论和技术以及工程管理原则和方法，按预算和进度，实现满足用户要求的软件产品的定义、开发、发布和维护的工程或进行研究的学科。 以较短的周期、较低的成本生产出高质量的软件产品，并最终实现软件的工业化生产。 8、简述软件生存期有哪些主要阶段组成，每个阶段的主要任务是什么？ 问题定义与可行性研究：问题定义必须回答的关键问题是：“要解决的问题是什么”。可行性研究要回答的关键问题是：“在成本和时间的限制条件下能否解决问题？是否值得做？”。需求分析：这个阶段的任务仍然不是具体地解决客户的问题，而是准确的回答“目标系统必须做什么”这个问题。软件设计：本阶段要回答的关键问题是“目标系统如何做？”为此，必须在设计阶段中制定设计方案，把已确定的各项需求转换成相应的软件体系架构。结构中的每一组成部分都是有意义明确的构件，此即所谓概要设计。进而具体描述每个构件所要完成的工作，为源程序编写打下基础，此即所谓详细设计。程序编码和单元测试：本阶段要解决的问题是“正确地实现已做的设计”，为此，需要选择合适的编程语言，把软件设计转换成计算机可以接受的程序代码，并对程序结构中的各个模块进行单元测试，然后运用调试的手段排除测试中发现的错误。集成测试和系统测试：集成测试的任务是将已测试过的模块按设计规定的顺序组装起来，在组装的过程中检查程序连接的问题。系统测试的任务是根据需求规格说明的要求，对必须实现的各项需求，逐项进行确认，判定已开发的软件是否符合用户需求，能否交付用户使用。运行维护：已交付的软件投入正式使用，便进入运行维护阶段。这一阶段可能持续若干年。软件在运行中可能由于多方面的原因，需要对它进行维护。通常有四种类型的维护：改正性维护、适应性维护、完善性维护和预防性维护。 9、区分单元测试、集成测试和系统测试。 10、软件工程的三种基本要素是什么？各自什么作用？ 方法、工具和过程。 软件工程方法为建造软件提供技术上的解决方法； 工具为方法的运用提供自动或半自动的软件支撑环境； 过程是获得高质量软件所需完成的一系列人物的框架，它规定了完成各项任务的工作步骤。 11、简述传统方法和面向对象方法的特点。 传统方法： 传统方法也称为生命周期方法或结构化范型。 它采用结构化技术来完成软件开发的各项任务。每一个阶段的开始和结束都有严格的标准，对于任何两个相邻的阶段而言，前一阶段的结束标准就是后一阶段开始的标准。 传统方法的主要缺点是在适应需求变化方面不够灵活，另外，结构化方法要么面向行为，要么面向数据，缺乏使两者有机结合的机制。 面向对象方法的特点： 面向对象方法把数据和行为看成同等重要，是将数据核对数据的操作紧密地结合起来的方法，这也是面向对象方法与传统方法的重要区别。 面向对象方法的出发点和原则，是尽量模拟人类西噶UN的思维方式，是开发软件的方法和过程尽可能接近人类认识问题和解决问题的方法与过程，从而使描述问题空间与其解空间在结构上尽可能一致。 对于大型、复杂及交互操作比较强的系统，使用面向对象方法更具优势。 12、形式化方法的特点是什么？ 形式化方法的特点： 软件需求规格说明被细化为用数学记号表达的详细的形式化规格说明。 设计、实现和单元测试等开发过程由一个变换开发过程代替。通过一系列变换将形式的规格说明细化成为程序。 13、软件开发过程中的常用软件有哪些？ 需求分析和设计工具。如：Rational Rose、Microsoft Office Visio等。 编码工具与排错工具。如：Visual C++ 6.0、Eclipse等。 测试工具。如：xUnit、IBM Rational Functional Tester、IBM Rational Robot等。 14、在软件工程知识体系中，将软件工程划分划分为哪些知识域？ SWEBOK指南将软件工程体系划分为15个知识域，这些知识域又划分为三类： 软件工程基础类：软件工程经济学、计算基础、工程基础、数学基础。 软件生存期过程类：软件工程模型和方法、软件需求、软件设计、软件构造、软件测试、软件维护。 软件工程管理类：软件工程过程、软件工程管理、软件配置管理、软件质量、软件工程专业实践。 学习所得，资料、图片部分来源于网络，如有侵权，请联系本人删除。","link":"/2020/03/03/%E7%AC%AC%E4%B8%80%E9%83%A8%E5%88%86%20%E8%BD%AF%E4%BB%B6%E5%B7%A5%E7%A8%8B%E6%A6%82%E8%BF%B0%EF%BC%88%E4%B8%80%EF%BC%89/"},{"title":"第二部分 结构化分析与设计方法（一）","text":"郑人杰 《软件工程概论》（第2版）第二部分 结构化分析与设计方法（一） 课后习题题解 第三章 软件需求获取与结构化分析方法 1、顶层数据流图（或称环境图）的作用是什么？ 顶层数据流图（或称环境图）仅包括一个数据处理过程，也就是要开发的目标系统。其作用如下： 确定系统在其环境中的位置，与系统有联系的外部实体（包括硬件、软件、组织机构及人）有哪些。 通过确定系统的输入和输出与外部实体的关系确定系统的边界，也就是要确定哪些功能或处理属于系统范围之内，哪些属于系统范围之外，需要由其他系统处理或人工处理。 2、简述使用数据流图进行需求分析的过程。 （1）确定系统的输入输出由于系统究竟包括哪些功能可能一时难于弄清楚，可使范围尽量大一些，把可能有的内容全部都包括进去。此时，应该向用户了解“系统从外界接受什么数据”、“系统向外界送出什么数据”等信息，然后，根据用户的答复画出数据流图的外围。（2）由外向里画系统的顶层数据流图首先，将系统的输入数据和输出数据用一连串的加工连接起来。在数据流的值发生变化的地方就是一个加工。接着，给各个加工命名。然后，给加工之间的数据命名。最后，给文件命名。（3）自顶向下逐层分解，绘出分层数据流图对于大型的系统，为了控制复杂性，便于理解，需要采用自顶向下逐层分解的方法进行，即用分层的方法将一个数据流图分解成几个数据流图来分别表示 [1] 。 3、在对数据流图进行分解时需要注意哪些问题？ 在对数据流图进行分解时，需要注意以下两个问题： 当对数据流图分层细化时必须保持信息连续性，也就是说，当把一个处理分解为一系列处理时，分解前和分解后的输入/输出数据流必须相同。 注意分层细化时对编号的处理方法。 4、请根据以下描述画出某库存管理系统的数据流图。该系统的数据流描述如下：（1）根据计划部门转来的收货通知单和已存在的物资编码文件，建立物资采购单流水账。（2）根据技术部门的物资验收报告和物资采购单流水账，更新物资台账文件。（3）对物资台账分类汇总，将结果存储于物资总账文件中。（4）物资出库，物资使用部门填写物资出库单，包括物资编号、物资名称、物资数量、物资使用部分、负责人、经手人。系统根据物资总账文件的库存情况判断是否能够出库，如果能够出库，则记录出库单，并更新物资总账文件。 5、分析院系、专业、班级、课程、教师、学生、成绩之间的数据关系，画出ER图。6、一家书店计划开发图书管理系统对书店的业务进行管理，以提高管理人员及书店工作人员的工作效率，并方便顾客对图书进行检索，书店管理系统的基本功能需求如下：（1）采购管理：实现与供货商的图书采购、退货及结算管理，提供月统计报表及任意时间段的统计报表。（2）图书信息管理：记录每种图书的信息（包括ISBN号、书名、作者、出版社、出版日期、单价、版次、印次等）、折扣及库存量，并提供简单的图书查询功能。（3）销售管理：实现图书销售功能，记录顾客购买的图书种类、数量，计算总价，打印销售小票，并付款。提供日/月统计报表及任意时间段的统计报表。（4）用户管理：提供用户组（角色）及用户管理功能。针对上面的需求建立需求分析模型，包括数据流图（至少画出两层）和ER图。 7、试题库管理系统的相关人员包括题库维护人员、教师及学生。系统的基本功能需求描述如下：（1）题库维护人员负责试题的添加、修改、删除工作。试题信息包括试题编号、试题内容、试题类型、参考答案、分值等。其中，试题类型包括选择题、判断题、填空题、应用题。（2）给教师提供自动组卷、手动组卷及打印试卷功能，教师可以指定试卷分值，并选择是否保存试卷。（3）给学生提供随机组卷，在线练习、在线评价功能。针对上面的需求建立需求分析模型，包括数据流图、ER图。针对为学生提供的功能，画出系统的状态图。 学习所得，资料、图片部分来源于网络，如有侵权，请联系本人删除。","link":"/2020/03/05/%E7%AC%AC%E4%BA%8C%E9%83%A8%E5%88%86%20%E7%BB%93%E6%9E%84%E5%8C%96%E5%88%86%E6%9E%90%E4%B8%8E%E8%AE%BE%E8%AE%A1%E6%96%B9%E6%B3%95%EF%BC%88%E4%B8%80%EF%BC%89/"},{"title":"第一部分 软件工程概述（二）","text":"郑人杰 《软件工程概论》（第2版）第一部分 软件工程概述（二） 课后习题题解 第二章 软件生存期模型 1、瀑布模型、快速原型模型、增量模型及螺旋模型都是传统的软件设计过程模型，请给出各个模型的特点。每种模型的优点和缺点是什么？适合于哪些场合？ 瀑布模型： 特点： 阶段间具有顺序性和依赖性； 具有推迟实现的观点； 具有质量保证的观点。优点： 符合软件开发的思维过程，并容易理解和运用; 通过设置里程碑，可以明确每个阶段的任务和目标； 支持结构化软件开发，可为各阶段制定开发计划，进行成本预算。 通过阶段审核，将开发过程纳入正轨； 严格的计划性保证软件产品的按时交付。缺点： 缺乏灵活性，不能适应用户需求的变化； 开始阶段的小错误会被逐级放大，可能最终导致软件产品报废； 缺乏演化性，返回上一级的开发需要十分昂贵的代价； 随着软件规模和复杂性的增加，软件产品成功的几率大幅下降。适用场合： 用户的需求非常清楚全面，且在开发过程中没有或很少变化； 规模较小的软件开发。 快速原型模型： 特点： 不要求需求预先完备定义； 支持需求的渐进式完善和确认； 支持用户参与，能够适应用户需求的变化。优点： 用户参与软件系统的所有阶段，可以得到比较良好的需求定义，容易适应需求的变化； 用户较早的接触和使用未来的系统，有利于系统后期的使用和维护； 开发费用低、开发周期短且对用户更友好。缺点： 客户与开发者对原型理解不同； 准确的原型设计比较困难； 不利于开发人员的创新。适用场合： 对所开发的领域比较熟悉而且有快速的原型开发工具； 项目招投标时，可以以原型模型作为软件的开发模型； 进行产品移植或升级时，或对已有产品原型进行客户化工作时，原型模型是非常适合的。 增量模型： 特点： 软件产品是被增量式地一块块开发的； 允许开发活动并行和重叠。 采用增量模型的优点是人员分配灵活，刚开始不用投入大量人力资源； 如果核心产品很受欢迎，则可增加人力实现下一个增量； 可先发布部分功能给客户，对客户起到镇静剂的作用。缺点： 并行开发构件有可能遇到不能集成的风险，软件必须具备开放式的体系结构； 增量模型的灵活性可以使其适应这种变化的能力大大优于瀑布模型和快速原型模型，但也很容易退化为边做边改模型，从而是软件过程的控制失去整体性。适用场合： 进行已有产品升级或新版本开发，增量模型是非常适合的； 对完成期限严格要求的产品，可以使用增量模型； 对所开发的领域比较熟悉而且已有原型系统，增量模型也是非常适合的。 螺旋模型： 特点：结合瀑布模型、快速原型模型和迭代模型的思想，并引进了风险分析活动。优点： 设计上的灵活性,可以在项目的各个阶段进行变更； 以小的分段来构建大型系统,使成本计算变得简单容易； 客户始终参与每个阶段的开发,保证了项目不偏离正确方向以及项目的可控性； 随着项目推进,客户始终掌握项目的最新信息 , 从而他或她能够和管理层有效地交互。缺点： 采用螺旋模型需要具有相当丰富的风险评估经验和专门知识，在风险较大的项目开发中，如果未能够及时标识风险，势必造成重大损失； 过多的迭代次数会增加开发成本，延迟提交时间。适用场合：螺旋模型只适合于大规模的软件项目。 2、如果在要求的期限内软件产品的所有功能都能够开发完成，上述四种模型中应选择哪种模型？如果只能完成一部分功能，又应该选择哪种模型？ 瀑布模型。严格的计划性保证软件产品的按时交付。 快速原型模型。用户参与软件系统的所有阶段，可以得到比较良好的需求定义，容易适应需求的变化。 3、可以合用几种模型吗？如果可以，举例说明。 过程模型可以合用，每个模型都有个有点不同的处理流程，但都执行相同的通用框架活动集：沟通，规划，建模，施工和交付/反馈。例如线性顺序模型可以作为一个有用的过程模型，沟通，规划，建模，施工和交付/反馈。例如线性顺序模型可以作为一个有用的过程模型，在被固定的情况下，要求工作以线性的方式继续进行，直至完成。在这情况下，开发者可能无法确定一种算法的效率，一个操作系统的适应性或应采取的人机交互的形式。在这之中，以及许多其他场合原型模型可以提供最好的办法。在其他情况下，以渐进的方式可能是有意义的和螺旋模型的流动可能是有效率，特殊过程模型具有许多的一个或多个传统的特性。 4、解释喷泉模型的特点及其适用的场合。 特点： 各阶段相互重叠，它反映了软件过程并行性的特点； 体现认识事物的往返过程； 强调增量开发，整个过程是一个迭代的逐步提炼的过程； 开发活动之间的无间隙性和循环迭代性； 适用于面向对象的开发过程。 强调无明显的活动阶段划分。适用场景：主要用于面向对象技术的软件开发项目，它克服了瀑布模型不支持软件重用和多项目开发活动集成的局限性，喷泉模型使开发过程具有迭代性和无间隙性。 5、统一过程与UML是同一概念吗？请给出解释。 统一过程与UML不是同一概念。 UML是一种语言，统一过程是用UML进行面向对象软件工程对的框架。 6、统一过程的6个核心过程工作流是什么？ 业务建模工作流； 需求工作流； 分析与设计工作流； 实现工作流； 测试工作流； 部署工作流。 7、给出两个核心支持工作流。 配置与变更管理； 项目管理。 8、统一过程的4个阶段是什么？ 初始阶段； 细化阶段； 构造阶段； 移交阶段。 9、请解释为什么基于构件的软件开发能够极大地提高软件开发的生产率和软件质量。 软件的复用是提高软件生产效率及软件质量的最有效途径，而基于构件的软件开发比面向对象的软件开发实现了更大粒度的软件复用，能够最大限度地减少重复劳动、缩短开发周期、降低开发成本，从而使软件生存率得到提高。由于已有的构件大都经过了很长时间的运行和测试，在质量方面比新开发的软件更有保证，同事软件架构技术有助于软件设计的标准化和设计风格的改进和统一，进而提高系统间的互操作性，软件可靠性和可维护性可以得到增强。 10、敏捷软件开发的特点是什么？ 迭代式开发。整个开发过程被分为几个迭代周期，每个迭代期是一个定长或不定长的时间块，每个迭代周期持续的时间一般较短，通常为1~6周。 增量交付。产品在每个迭代周期结束时被逐步交付使用，而不是在整个开发过程结束时一次性交付。每次交付的都是可被部署到用户应用环境中的、能给用户带来即时效益和价值的产品。 开发团队和用户反馈推动产品开发。敏捷开发方法主张用户能够全程参与整个开发过程。这使需求变化和用户反馈能动态管理并及时集成到产品中。同时，团队也能及时对用户的需求提供反馈意见。 持续集成。新的功能或需求变化总是尽可能频繁地被整合到产品中。一些项目是在每个迭代周期结束的时候集成，有些项目则每天都在集成。 开发团队自我管理。拥有一个积极的、自我管理的、具备自由交流风格的开发团队，是每个敏捷项目的必要条件。敏捷开发总是以人为中心建立开发的过程和机制，而非把过程和机制强加给人。 11、简述敏捷软件开发的原则。 持续、尽早交付有价值的软件以满足用户，是我们优先要做的首要任务。 拥抱需求变更，甚至是在开发的后期。敏捷过程利用变更为客户带来竞争优势。 频繁交付可执行的软件，从几周到几个月，交付时间越短越好。 在整个项目过程中，业务人员和开发人员必须每天一起工作。 激发每个团队成员的积极性来打造项目。为他们提供环境与支持，并且信任他们可以完成工作。 在一个开发团队内部最有效的传递信息的方式是面对面交流。 可执行的软件是进度的首要检验对象。 敏捷过程倡导可持续发展。赞助商、开发人员和用户用该尽可能保持一致的步伐。 不断地关注优秀技能和好的设计会增强敏捷能力。 尽量用艺术化来简单阐述未完成的工作是很有必要的。 最好的架构、需求和设计出自于自我组织管理的团队。 每隔一段时间，回顾反思如何让团队变得更高效，并相应地调整其行为。 12、用自己的语言描述XP的重构和结对编程的概念。 重构是以不改变代码外部行为而改进其内部结构的方式来修改软件系统的过程。这是一种净化代码以尽可能减少引入错误的严格方法。实质上，重构就是在编码完成之后改进代码设计。 结对编程是这样一种程序设计实践：两名程序员并肩同坐在同一台计算机前，共同探讨设计方案、共同设计算法、共同编写程序代码、共同完成各种测试。 13、你认为本书所讲的哪种过程模型适合互联网软件的开发及维护？还是都不合适？学习所得，资料、图片部分来源于网络，如有侵权，请联系本人删除。","link":"/2020/03/04/%E7%AC%AC%E4%B8%80%E9%83%A8%E5%88%86%20%E8%BD%AF%E4%BB%B6%E5%B7%A5%E7%A8%8B%E6%A6%82%E8%BF%B0%EF%BC%88%E4%BA%8C%EF%BC%89/"}],"tags":[{"name":"hexo","slug":"hexo","link":"/tags/hexo/"},{"name":"Java","slug":"Java","link":"/tags/Java/"},{"name":"JavaSE","slug":"JavaSE","link":"/tags/JavaSE/"},{"name":"OOP","slug":"OOP","link":"/tags/OOP/"},{"name":"Java SE","slug":"Java-SE","link":"/tags/Java-SE/"},{"name":"软件工程","slug":"软件工程","link":"/tags/%E8%BD%AF%E4%BB%B6%E5%B7%A5%E7%A8%8B/"}],"categories":[{"name":"学习","slug":"学习","link":"/categories/%E5%AD%A6%E4%B9%A0/"},{"name":"算法","slug":"算法","link":"/categories/%E7%AE%97%E6%B3%95/"}]}